app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])  # AR's find method searches the id
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]